### Terraform Plan — `staging`

<details>
<summary>Pass Click to expand plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.compute.data.aws_ecr_repository.backend: Reading...
module.networking.aws_vpc.main: Refreshing state... [id=vpc-01cafe26e07c68050]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-north-1:442426888142:cluster/quickpoll-team7-staging]
module.compute.data.aws_ecr_repository.frontend: Reading...
module.ecs.data.aws_caller_identity.current: Reading...
module.ecs.data.aws_caller_identity.current: Read complete after 1s [id=442426888142]
module.compute.data.aws_ecr_repository.backend: Read complete after 2s [id=quickpoll-team7-backend]
module.compute.data.aws_ecr_repository.frontend: Read complete after 2s [id=quickpoll-team7-frontend]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0385b1becf907912f]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-09971d0ae5b8332fb]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0321cea595fcdba86]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-01a99c733857046b0]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-051a4cfe58e2ac717]
module.security.aws_security_group.alb: Refreshing state... [id=sg-0cb154d1689f6ec7e]
module.security.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0a1c01e0657b0dd9c]
module.security.aws_security_group.rds: Refreshing state... [id=sg-0784bbef2079088b0]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0c36d564937a8d9cc]
module.security.aws_vpc_security_group_egress_rule.rds_all_traffic: Refreshing state... [id=sgr-00692991e03b01799]
module.security.aws_vpc_security_group_ingress_rule.rds_from_ecs: Refreshing state... [id=sgr-0872d0f24140ecc3b]
module.security.aws_vpc_security_group_egress_rule.ecs_tasks_all_traffic: Refreshing state... [id=sgr-071d08540890df4ea]
module.security.aws_vpc_security_group_ingress_rule.backend_from_alb: Refreshing state... [id=sgr-00581bd22afcedc9a]
module.security.aws_vpc_security_group_ingress_rule.frontend_from_alb: Refreshing state... [id=sgr-0e51215ce53a6dffa]
module.security.aws_vpc_security_group_ingress_rule.alb_https: Refreshing state... [id=sgr-0e1676cd9be24f53a]
module.security.aws_vpc_security_group_egress_rule.alb_all_traffic: Refreshing state... [id=sgr-04c0f82bd5d025abc]
module.security.aws_vpc_security_group_ingress_rule.alb_http: Refreshing state... [id=sgr-0a5f5084ab1fa6353]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06669321f1ddad51e]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05bf6e4a1dea2d4fe]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.database.aws_cloudwatch_metric_alarm.db_connections will be created
  + resource "aws_cloudwatch_metric_alarm" "db_connections" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS connections > 80 for 10 minutes"
      + alarm_name                            = "quickpoll-team7-staging-db-high-connections"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "quickpoll-team7-staging-db"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseConnections"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-db-connections-alarm"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-db-connections-alarm"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.database.aws_cloudwatch_metric_alarm.db_cpu will be created
  + resource "aws_cloudwatch_metric_alarm" "db_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS CPU utilization > 80% for 15 minutes"
      + alarm_name                            = "quickpoll-team7-staging-db-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "quickpoll-team7-staging-db"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-db-cpu-alarm"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-db-cpu-alarm"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.database.aws_cloudwatch_metric_alarm.db_free_storage will be created
  + resource "aws_cloudwatch_metric_alarm" "db_free_storage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS free storage < 5 GB"
      + alarm_name                            = "quickpoll-team7-staging-db-low-storage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "quickpoll-team7-staging-db"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeStorageSpace"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-db-storage-alarm"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-db-storage-alarm"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + threshold                             = 5368709120
      + treat_missing_data                    = "missing"
    }

  # module.database.aws_db_event_subscription.main will be created
  + resource "aws_db_event_subscription" "main" {
      + arn              = (known after apply)
      + customer_aws_id  = (known after apply)
      + enabled          = true
      + event_categories = [
          + "backup",
          + "failure",
          + "maintenance",
          + "notification",
          + "recovery",
        ]
      + id               = (known after apply)
      + name             = "quickpoll-team7-staging-rds-events"
      + name_prefix      = (known after apply)
      + sns_topic        = (known after apply)
      + source_ids       = [
          + "quickpoll-team7-staging-db",
        ]
      + source_type      = "db-instance"
      + tags             = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-rds-event-sub"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-rds-event-sub"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
    }

  # module.database.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "quickpoll"
      + db_subnet_group_name                  = "quickpoll-team7-staging-db-subnet"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "quickpoll-team7-staging-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:04:00-sun:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Backup"      = "enabled"
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-db"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                              = {
          + "Backup"      = "enabled"
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-db"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + timezone                              = (known after apply)
      + username                              = "quickpoll"
      + vpc_security_group_ids                = [
          + "sg-0784bbef2079088b0",
        ]
    }

  # module.database.aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "quickpoll-team7-staging-db-subnet"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0385b1becf907912f",
          + "subnet-09971d0ae5b8332fb",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-db-subnet"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-db-subnet"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + vpc_id                  = (known after apply)
    }

  # module.database.aws_sns_topic.rds_events will be created
  + resource "aws_sns_topic" "rds_events" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "quickpoll-team7-staging-rds-events"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-rds-events"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-rds-events"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + tracing_config              = (known after apply)
    }

  # module.ecs.aws_appautoscaling_policy.backend_cpu will be created
  + resource "aws_appautoscaling_policy" "backend_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "quickpoll-team7-staging-backend-cpu-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/quickpoll-team7-staging/quickpoll-team7-staging-backend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.backend_memory will be created
  + resource "aws_appautoscaling_policy" "backend_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "quickpoll-team7-staging-backend-mem-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/quickpoll-team7-staging/quickpoll-team7-staging-backend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.frontend_cpu will be created
  + resource "aws_appautoscaling_policy" "frontend_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "quickpoll-team7-staging-frontend-cpu-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/quickpoll-team7-staging/quickpoll-team7-staging-frontend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 70

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.frontend_memory will be created
  + resource "aws_appautoscaling_policy" "frontend_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "quickpoll-team7-staging-frontend-mem-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/quickpoll-team7-staging/quickpoll-team7-staging-frontend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.backend will be created
  + resource "aws_appautoscaling_target" "backend" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/quickpoll-team7-staging/quickpoll-team7-staging-backend"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
    }

  # module.ecs.aws_appautoscaling_target.frontend will be created
  + resource "aws_appautoscaling_target" "frontend" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 2
      + min_capacity       = 1
      + resource_id        = "service/quickpoll-team7-staging/quickpoll-team7-staging-frontend"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.backend will be created
  + resource "aws_cloudwatch_log_group" "backend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/quickpoll-team7-staging-backend"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-backend-logs"
          + "Project"     = "quickpoll-team7"
          + "Service"     = "backend"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-backend-logs"
          + "Project"     = "quickpoll-team7"
          + "Service"     = "backend"
          + "Team"        = "team7"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.frontend will be created
  + resource "aws_cloudwatch_log_group" "frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/quickpoll-team7-staging-frontend"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-frontend-logs"
          + "Project"     = "quickpoll-team7"
          + "Service"     = "frontend"
        }
      + tags_all          = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-frontend-logs"
          + "Project"     = "quickpoll-team7"
          + "Service"     = "frontend"
          + "Team"        = "team7"
        }
    }

  # module.ecs.aws_ecs_service.backend will be created
  + resource "aws_ecs_service" "backend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-north-1:442426888142:cluster/quickpoll-team7-staging"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "quickpoll-team7-staging-backend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-backend-service"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-backend-service"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = true

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "backend"
          + container_port   = 8081
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0a1c01e0657b0dd9c",
            ]
          + subnets          = [
              + "subnet-0385b1becf907912f",
              + "subnet-09971d0ae5b8332fb",
            ]
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.frontend will be created
  + resource "aws_ecs_service" "frontend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "arn:aws:ecs:eu-north-1:442426888142:cluster/quickpoll-team7-staging"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "quickpoll-team7-staging-frontend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-frontend-service"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-frontend-service"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = true

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "frontend"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0a1c01e0657b0dd9c",
            ]
          + subnets          = [
              + "subnet-0385b1becf907912f",
              + "subnet-09971d0ae5b8332fb",
            ]
        }
    }

  # module.ecs.aws_ecs_task_definition.backend will be created
  + resource "aws_ecs_task_definition" "backend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "quickpoll-team7-staging-backend"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-backend-task"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-backend-task"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_ecs_task_definition.frontend will be created
  + resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "wget --no-verbose --tries=1 --spider http://localhost:8080/health || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 10
                      + timeout     = 5
                    }
                  + image            = "placeholder:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/quickpoll-team7-staging-frontend"
                          + awslogs-region        = "eu-north-1"
                          + awslogs-stream-prefix = "frontend"
                        }
                    }
                  + name             = "frontend"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "quickpoll-team7-staging-frontend"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-frontend-task"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-frontend-task"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_service_discovery_service.backend will be created
  + resource "aws_service_discovery_service" "backend" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "backend"
      + namespace_id  = (known after apply)
      + tags_all      = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 60
              + type = "A"
            }
        }

      + health_check_custom_config {}
    }

  # module.ecs.aws_ssm_parameter.db_password will be created
  + resource "aws_ssm_parameter" "db_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database password for staging"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/quickpoll-team7/staging/db-password"
      + overwrite      = true
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-db-password"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-db-password"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecs.aws_ssm_parameter.jwt_secret will be created
  + resource "aws_ssm_parameter" "jwt_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "JWT secret for staging"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/quickpoll-team7/staging/jwt-secret"
      + overwrite      = true
      + tags           = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-jwt-secret"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-jwt-secret"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.loadbalancer.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "quickpoll-team7-staging-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-0cb154d1689f6ec7e",
        ]
      + subnets                                                      = [
          + "subnet-0321cea595fcdba86",
          + "subnet-051a4cfe58e2ac717",
        ]
      + tags                                                         = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-alb"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                                                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-alb"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.loadbalancer.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-http-listener"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                                                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-http-listener"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.alertmanager will be created
  + resource "aws_lb_listener_rule" "alertmanager" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 130
      + tags         = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-alertmanager-rule"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-alertmanager-rule"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/alertmanager",
                  + "/alertmanager/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.api will be created
  + resource "aws_lb_listener_rule" "api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags         = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-api-rule"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-api-rule"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/actuator/*",
                  + "/api-docs*",
                  + "/api/*",
                  + "/swagger-ui/*",
                  + "/v3/api-docs*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.jaeger will be created
  + resource "aws_lb_listener_rule" "jaeger" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 120
      + tags         = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-jaeger-rule"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-jaeger-rule"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/jaeger",
                  + "/jaeger/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.loki will be created
  + resource "aws_lb_listener_rule" "loki" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 140
      + tags         = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-loki-rule"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-loki-rule"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/loki",
                  + "/loki/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.monitoring will be created
  + resource "aws_lb_listener_rule" "monitoring" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 110
      + tags         = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-mon-rule"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-mon-rule"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/grafana",
                  + "/grafana/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_target_group.alertmanager will be created
  + resource "aws_lb_target_group" "alertmanager" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-staging-alm-tg"
      + name_prefix                        = (known after apply)
      + port                               = 9093
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-alm-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-alm-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-01cafe26e07c68050"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/-/healthy"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.loadbalancer.aws_lb_target_group.backend will be created
  + resource "aws_lb_target_group" "backend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-staging-be-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8081
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-be-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-be-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-01cafe26e07c68050"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }
    }

  # module.loadbalancer.aws_lb_target_group.frontend will be created
  + resource "aws_lb_target_group" "frontend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-staging-fe-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-fe-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-fe-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-01cafe26e07c68050"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.loadbalancer.aws_lb_target_group.jaeger will be created
  + resource "aws_lb_target_group" "jaeger" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-staging-jae-tg"
      + name_prefix                        = (known after apply)
      + port                               = 16686
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-jae-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-jae-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-01cafe26e07c68050"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.loadbalancer.aws_lb_target_group.loki will be created
  + resource "aws_lb_target_group" "loki" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-staging-loki-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3100
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        = "quickpoll-team7-staging-loki-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-staging-loki-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-01cafe26e07c68050"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/ready"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.loadbalancer.aws_lb_target_group.monitoring will be created
  + resource "aws_lb_target_group" "monitoring" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-staging-mon-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "staging"
          + "Name"        =
... (truncated)
```

</details>

*Triggered by @Viateur-akimana on `develop`*